# Lab 1 Setting up the Weather database

We need to download the database first by using the following code in a *code block* and also upgrade the version of the SQL database (SQLite).
We can run the code by pressing the "â–¶" play button. This needs to be run once at the begining of the session.

In [1]:
!wget https://essexuniversity.box.com/shared/static/c3vee0c2iclzc9wouhblr9jp5v7lix0o.db -O weather.db &> /dev/null

In order to issue SQL commands we will use the SQLite capabilities of Google Colab by loading the SQL extension with the statement `%load_ext sql`:

In [2]:
# now we can use the magic extension to connect to our SQLite DB
# use %sql to write an inline SQL command
%load_ext sql
# Loads the downloaded database (weather data) inthis case
%sql sqlite:///weather.db
# Shows the sqlite version
%sql SELECT sqlite_version();

 * sqlite:///weather.db
Done.

[('3.37.2',)]

Then we can run SQL queries by using:
- the `%sql` expression for a single line query
- the `%%sql` expression for a multiple line query

## Display all tables
As an example we cal display all the tabled loadded in the database by using the
following statement:

In [3]:
# Display all the table names
# omiting the ones starting with "sqlite_" (internal not to be used directly)
%%sql
SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite_%';

 * sqlite:///weather.db
Done.

[('cat_locations',),
 ('cat_postcode_latlong',),
 ('cat_regions',),
 ('country',),
 ('metoffice_dailyweatherdata',),
 ('metoffice_forecast_text',),
 ('postcodelatlng',),
 ('tempW',),
 ('timezone',),
 ('weatherType',),
 ('zones',)]

# Exercise PART I
MySQL can open multiple databases so we need to specify the name of the database (e.g. `DATABASE_NAME.TABLE_NAME`).
But `SQLite` (the SQL database that we use in this notebook) opens only one database at a time and we don't use the name of the database. As an example the table `cat_regions` is:
- **MySQL**: `weather_db.cat_regions`
- **SQLite**: `cat_regions`

## Exercise 1
Using the CREATE TABLE statement, create a table called `client_data` with the
following schema:

Field       | Data Type  | Constaint
------------|------------|-------------------
ID          | integer    | Primary key
First_name  | varchar 40 | NOT NULL
Last_name   | varchar 40 | None
Nationality | varchar 40 | None
Age         | float      | greather than 18

In [6]:
%%sql
CREATE TABLE client_data(
ID int PRIMARY KEY,
First_name  VARCHAR(40) NOT NULL,
Last_name   VARCHAR(40),
Nationality VARCHAR(40) ,
Age DECIMAL,CHECK (Age>18))

 * sqlite:///weather.db
Done.

[]

## Exercise 2
Insert the following records in the data base using the `INSERT` statement:

ID	| first_name	| last_name	| nationality	| Age
----|-------------|-----------|-------------|------
1	  | John	      | S	        | British	    |None
2	  | Peter	      |Jackson    |	None	      |20
3	  | Tom         |	W         |	None        |20
4	  | Jack	      |Patrick	  | American    |30

In [41]:
%%sql
INSERT INTO client_data ("ID","first_name","last_name", "nationality","Age") VALUES (1,"John","S","British",null),
(2,"Peter","Jackson",null,20),
(3,"Tom","W",null,20),
(4,"Jack","S","American",30)

 * sqlite:///weather.db
(sqlite3.IntegrityError) UNIQUE constraint failed: client_data.ID
[SQL: INSERT INTO client_data ("ID","first_name","last_name", "nationality","Age") VALUES (1,"John","S","British",null),
(2,"Peter","Jackson",null,20),
(3,"Tom","W",null,20),
(4,"Jack","S","American",30)]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

## Exercise 3
Add a column called "type" to the Client_data table and fill the records of this column with the value '1' for the records where nationality is known, and '2' otherwise.

In [15]:
%%sql
ALTER TABLE client_data ADD "type" INTEGER

 * sqlite:///weather.db
Done.

[]

In [42]:
%%sql
UPDATE client_data set type=CASE
                                WHEN Nationality NOT NULL THEN 1
                                ELSE 2
                              END;

 * sqlite:///weather.db
4 rows affected.

[]

In [43]:
%%sql
select * from client_data

 * sqlite:///weather.db
Done.

[(1, 'John', 'S', 'British', 'None', 1),
 (2, 'Peter', 'Jackson', 'None', 20.0, 1),
 (3, 'Tom', 'W', 'None', 20.0, 1),
 (4, 'Jack', 'S', 'American', 30.0, 1)]

## Exercise 4
Delete the records of the table client_data where the last name is unknown.
Although we donâ€™t have any fields with this constraint, we can still use:

In [44]:
%%sql
DELETE FROM client_data WHERE Nationality IS NULL;

 * sqlite:///weather.db
(sqlite3.OperationalError) near "%": syntax error
[SQL: %%sql
DELETE FROM client_data WHERE Nationality IS NULL;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

## Exercise 5
Delete all the content from the column â€˜Ageâ€™ **without** deleting the column from the schema.

In [ ]:
%%sql
UPDATE client_data set Age=NULL;

## Exercise 6
Delete table client_data including the schema.

In [ ]:
%%sql
DROP TABLE client_data;

# PART 2

## Exercise 1
There are many records in the table `cat_locations` where the country column is null. Fill these records with the value `"UK"`.

In [48]:
%%sql
UPDATE cat_locations set Country='UK' where Country IS NULL;

 * sqlite:///weather.db
0 rows affected.

[]


## Exercise 2
Delete the rows from table `tempW` where rainfall is `null`

In [ ]:
%%sql
DELETE FROM tempW where rainfall is NULL;

## Exercise 3
From this table also delete the `timestamp` column from the schema.

In [ ]:
%%sql
ALTER TABLE tempW DROP COLUMN timestamp;